{"741029163": {"resume": "Rahulraj P V\nIIITMK (DUK) M.Tech CSE (AI) Student | IIM Kozhikode Research Intern\nE-mail: rahulraj.cs22@duk.ac.in ✼Mobile number: +91 9061360912\nWebsite\nLinkedin\nMedium\nInstagram\nGithub Twitter\nEducation\nMTech in Computer Science & Engineering\nDigital University Kerala (Formerly IIITMK)\nWith specialization in AI\nAugust 2022- August 2024\nPost Graduate Diploma Data Science & Analytics\nKannur University\nDepartment of IT\nAugust 2021 - July 2022\nMaster of Science in Physics\nKannur University\nDepartment of Physics\nJuly 2019 - July 2021\nWork experience\n1. Creative AI Specialist\nJanuray 2024 - Present\nMozilla RCC DUK\nKerala , India\n•\nContributing to the development of innovative generative AI solutions for creative applications in\nmedia and ﬁlmmaking as part of the Mozilla Playbook initiative\n2. AI R & D Engineer\nDecember 2024 - Present\nKerala Blockchain Academy\nTrivandrum, Kerala\n•\nWorking on projects related to large language models, computer vision, and other advanced tech-\nnologies in collaboration with experts and researchers in blockchain & AI at KBA.\n3. Co-Founder\nJuly 2024 - Present\nKnowLumi\nKozhikode, Kerala\n•\nCo-founded a platform empowering students to get opportunities like IITians using AI. Focused\non developing AI tools & fostering connections with expert mentors.\n4. Research Intern\nJuly 2023 – December 2023\nIndian Institute of Management–Kozhikode (IIM–Kozhikode)\nCalicut, Kerala\n•\nCompleted a project on Large Language Models under the mentorship of Dr. Mohammed Shahid\nAbdulla, Associate Professor in the Department of Information Systems at IIM Kozhikode.\n5. Data Scientist Intern\nFebruary 2022 – June 2022\nFirst Principle Labs\nCalicut, Kerala\n•\nDeveloped a tool for forecasting the Real-time big data of Google Trends keywords using Google\nTrends. For future prediction, diﬀerent Machine learning techniques are used.\n6. AI R & D Intern\nFebruary 2022 - May 2022\nPixDynamics\nKochi, Kerala\n•\nDeveloped a program to extract data from demand drafts , passports & cheques of major banks in\nIndia under the guidance of senior AI developers in PixDynamics.\n7. Research Intern\nApril 2021 - June 2021\nCSIR National Physical Laboratory\nNew Delhi, India\n•\nCompleted a research project on ”Impact of Covid - 19 on Angstrom Exponent using NASA’s\nAERONET project” under the guidance of Dr. Sumit Mishra, Principal Scientist, CSIR NPL.\n\nResearch Papers\n1. Monetize the dual: A data analytic approach for native language & prequel movies\npopularity analysis”, International Conference on Data Analytics & Insights (ICDAI’23)\n- Springer\nRahulraj P.V., Sanil J., Anoop V. S., Asharaf S.(Published)\n2. Changes in Atmospheric Air Quality in the Wake of a Lockdown Related to Covid\n– 19 in the Capital City of Southern State of India, Kerala , IJAES’22 (International\nJournal of Agriculture & Environmental Science ) Rahulraj P.V., Ebin Antony (Published)\nResearch Projects\n1.\nIndia’s First AI campus Radio : Developed an AI-driven campus radio using large lan-\nguage models, optimizing engagement through dynamic genre sequencing & personalized con-\ntent.(Currently on testing phase - Available on Google play store)\n2. DNA Inspired Algorithm for Movie Success : Created an algorithm inspired by DNA\nsequencing to analyze genre patterns & predict movie success based on narrative structures &\naudience engagement using Deep learning techniques and large language models.\n3. Real - Time Film Analysis with Computer Vision & Neuroscience: Studied the impact\nof facial expressions & blink rates on ﬁlm reception, linking emotional & attentional responses to\naudience engagement.\n4. LLM Based Gamiﬁed Decision Tree-Based Story Writing Tool: Developed an interactive\nAI tool using decision trees & gamiﬁcation to generate branching narratives, enabling dynamic, user-\ndriven storytelling.\nAwards & Achievements\n1. Outstanding Student Award, Digital University Kerala\n2022-24 Batch\n2. Smart India Hackathon 2023 - University Level\nFirst\n3. Cisco ThingQbator National Level Tech Quiz & Sustainability Hackathon\nSecond\n4. Sharktank Hackathon - Google Developer Student Club, WoW Kerala\nFirst\n5. Directed the Malayalam musical album ’Silent Spring’, which received signiﬁcant\ncritical acclaim & was selected for publication on Amazon Prime.\nSkills\n1. Programming Languages: Python, R\n2. Tools & Technologies: Machine Learning, Computer Vision, Deep Learning, Large Lan-\nguage Models (LLMs), Generative AI, Natural Language Processing (NLP), Data Science &\nAnalytics, Data Visualization, Statistics, Prompt Engineering, TensorFlow, Scikit-learn, Pan-\ndas, PyTorch, Origin Pro, Figma, PyQt5, Streamlit,RAG , Multi- Agents, PEFT, Git, Microsoft\nOﬃce, LaTeX,GitHub. EEG (Practical Experience), Cognitive Science, Applied Physics.\n3. Creative Skills: Screenplay Writing (awarded at national & university levels), Photography,\nFilm Direction, Video Editing, Poster Design, PowerPoint (Presentation Specialist), Adobe\nPremier Pro , Adobe After Eﬀects", "search_keywords": ["AI Engineer"], "search_location": "India", "min_match_score": 70, "jobs_sent": ["li_2003630582800496564", "li_7676261626354390527", "li_-1184879250640194287", "li_-8549429965581399750", "li_8874962447978441248", "li_-866964056461919219", "li_7364962980660325081", "li_-7841186284943794802", "li_-6843719322343126786", "li_-7610063213864892692", "li_-2368740019861671495", "li_5524795143475364763", "li_794325781319538810", "li_6327761154020420862", "li_-679676503322908099", "li_4607073253554803634", "li_972716233868933323", "li_386105948813524633", "li_-966947955052830895", "li_3237348564847351164", "li_-6707278903719641582", "li_-7900423446385196119", "li_4596401645098874345", "li_-3792091613699329057", "li_6699176316362315846", "li_-8526962685013701151", "li_-6922991450758226628", "li_1355577700919728974", "li_-8921192528526688213", "li_389757682480130930", "li_8217159570414972322"], "notification_time": "09:00", "is_active": true, "last_activity": "2025-04-05T08:23:13.853586"}, "411978263": {"resume": "Hayden Smith  \n214 Mitre Avenue, Park Hill, 3045 |  04501 123 456  |  haydensmith@email.com \nPage 1 \n \n \n(Tip: Name, mobile number and email address are essential. Current address could be included \nespecially if you live nearby. Ensure that it is clearly displayed) \nCareer Objective  \nI am reliable hard working Year 11 student seeking casual or part-time customer service work in a \nsports retail environment. Having played soccer for nine years and a keen all-round sports \nenthusiast, I am looking to contribute knowledge and proven communications skills.  \n \n(Tip: A career objective isn’t essential, but it’s useful if you don't have much experience and can \nconvey enthusiasm and motivation. Briefly summarise any work you have done, your strengths and \nrelevant expertise and state how you aim to apply this to your career goal. Adjust the statement to \nreflect the role you are applying for.)   \nAvailability \nMonday – Friday: 4.30pm – 10.00pm \nSaturday – Sunday: 8.00am – 11.00pm \n(up to 20 hours per week) \n \n(Tip: When looking for part-time casual work, it can be a good idea to include availability. If you’re a \nstudent, clearly state the maximum number of hours you are able to work per week.) \nKey Skills \n• \nCustomer service ability demonstrated when working efficiently in soccer club canteen. \n• \nNumeracy skills for cash handling tasks proven by achieving good results for mathematics \nsubjects.  \n• \nHighly developed communication skills shown by receiving positive feedback from \nsupervisors after completing work experience.  \n• \nStrong ability to work as part of a team developed through participating in soccer since the \nage of eight. \n• \nDemonstrated organisation skills as a result handing all assignments in on time. \n• \nAble to take responsibility and solve problems proven through umpiring and coaching.  \n \n (Tip: Include 5-9 key skills as bullet points that you like using and that are relevant to the role. When \napplying for advertised roles, match to any criteria listed in the advertisement. Use action words such \nas ‘demonstrated’ or ‘highly developed’ and then provide information about when, where and how \nyou’ve used the skill through your studies, work experience, volunteering, sporting activities, etc.) \nEducation \nCurrent  \n \nPark Hill Secondary College \n \nYear 11 \n• \nSubjects include: Maths, English, Business Management, VET studies in Sport and \nRecreation. \n \n(Tip: List your most recent education qualifications first including any relevant university degrees and \ncertificates. Professional development such as short training courses, workshops, licences, forms of \naccreditation, and other training can be included but is usually a separate heading.) \nWork Experience  \n\n \n \nHayden Smith \nPage 2 \n \nDecember 2016 – March 2017 \nPark Hill Soccer Club Canteen  \nCustomer service (volunteer) \n• \nServed customers. \n• \nHandled cash including operating of cash register. \n \nJune 2016 – February 2017 \nArgo Newsagency \n \n \nNewspaper deliverer \n• \nDelivered weekend newspapers to houses. \n \n(Tip: Focus on most recent work experience first. Include your job title, organisation name and dates. \nYears and months can be included. Include responsibilities and achievements for each role.) \nLeadership Roles  \n2016 – current  \n \n \n \nSoccer umpire for under 14 team \nPark Hill Soccer Club \n \n2017 – current  \n \n \n \nAssistant Coach for junior players \nPark Hill Soccer Club \n \n(Tip: Include any volunteering, community participation or leaderships roles.) \nInterests/Hobbies \n• \nPlayed soccer since the age of eight. \n• \nKeen spectator of soccer, football and cricket. \n \n(Tip: Including a section on interests can be useful if it’s relevant and active. Only include those \ninterests which are relevant to the job you are applying for or those which demonstrate your \nproactive or positive traits.)    \n \nReferees \nJohn Charles \nCoach \nHill Park Soccer Club \n0456 789 101 \nJohn_charles@hillpark.edu \nWendy Stevens \nYear 11 Coordinator \nHill Park Secondary College \n*Contact details available on request \n \n(Tip: If you decide to include referee contacts, notify the referee and indicate the type of roles that \nyou will be applying for. You may also want to provide them with a copy of your resume. You can \nalso simply write ‘Available on request’.)", "search_keywords": ["software engineer"], "search_location": "kochi", "min_match_score": 50, "jobs_sent": [], "notification_time": "09:00", "is_active": true, "last_activity": "2025-04-05T08:59:02.832832"}}